[
  {
    "name": "Avatar Aang",
    "description": "The main protagonist of ATLA, a young Airbender who masters all four elements to restore balance to the world."
  },
  {
    "name": "Katara",
    "description": "A compassionate waterbender from the Southern Water Tribe who helps Aang on his journey."
  },
  {
    "name": "Sokka",
    "description": "Katara’s non-bender brother, a witty warrior and strategist in ATLA."
  },
  {
    "name": "Toph Beifong",
    "description": "A blind earthbender who teaches Aang earthbending and invents metalbending."
  },
  {
    "name": "Zuko",
    "description": "A Fire Nation prince seeking redemption, later becoming Fire Lord in ATLA."
  },
  {
    "name": "Avatar Korra",
    "description": "The headstrong Avatar in LOK, mastering all elements while facing modern challenges."
  },
  {
    "name": "Mako",
    "description": "A firebender and Korra’s initial love interest in LOK, known for his serious demeanor."
  },
  {
    "name": "Bolin",
    "description": "Mako’s cheerful earthbender brother in LOK, who later masters lavabending."
  },
  {
    "name": "Asami Sato",
    "description": "A non-bender heiress and inventor in LOK, who becomes Korra’s close friend and partner."
  },
  {
    "name": "Tenzin",
    "description": "Aang’s son and an airbending master who mentors Korra in LOK. Supporting Characters 🤝 These characters play important roles in specific episodes or story arcs."
  },
  {
    "name": "Appa",
    "description": "Aang’s loyal sky bison, serving as the team’s transport in ATLA."
  },
  {
    "name": "Momo",
    "description": "Aang’s pet winged lemur, providing comic relief in ATLA."
  },
  {
    "name": "Suki",
    "description": "Leader of the Kyoshi Warriors and Sokka’s love interest in ATLA."
  },
  {
    "name": "Uncle Iroh",
    "description": "Zuko’s wise and kind firebending mentor in ATLA, known for his love of tea."
  },
  {
    "name": "Azula",
    "description": "Zuko’s ruthless sister, a firebending prodigy and antagonist in ATLA."
  },
  {
    "name": "Fire Lord Ozai",
    "description": "The tyrannical Fire Nation ruler and main antagonist in ATLA."
  },
  {
    "name": "Lin Beifong",
    "description": "Toph’s daughter and Republic City’s tough police chief in LOK."
  },
  {
    "name": "Jinora",
    "description": "Tenzin’s daughter, a skilled airbender with spiritual abilities in LOK."
  },
  {
    "name": "Naga",
    "description": "Korra’s loyal polar bear-dog companion in LOK."
  },
  {
    "name": "Pabu",
    "description": "Bolin’s mischievous fire ferret in LOK."
  },
  {
    "name": "Chief Hakoda",
    "description": "Katara and Sokka’s father, leader of the Southern Water Tribe in ATLA."
  },
  {
    "name": "Tonraq",
    "description": "Korra’s father and chief of the Southern Water Tribe in LOK."
  },
  {
    "name": "Unalaq",
    "description": "Korra’s uncle and a waterbending antagonist in LOK Book 2. Kya (Aang’s daughter): Aang and Katara’s waterbending daughter and healer in LOK."
  },
  {
    "name": "Eska and Desna",
    "description": "Unalaq’s waterbending twin children in LOK."
  },
  {
    "name": "Fire Lord Izumi",
    "description": "Zuko’s daughter and Fire Lord in LOK, focused on peace. Minor Characters 📜 These characters have brief but memorable roles in the series or comics."
  },
  {
    "name": "Ursa",
    "description": "Zuko and Azula’s mother, whose backstory is explored in the ATLA comics."
  },
  {
    "name": "Fire Lord Azulon",
    "description": "Ozai and Iroh’s father, a former Fire Lord in ATLA."
  },
  {
    "name": "Prince Lu Ten",
    "description": "Iroh’s son, who died during the war in ATLA."
  },
  {
    "name": "The Great Sage",
    "description": "Leader of the Fire Sages in ATLA, overseeing spiritual duties."
  },
  {
    "name": "Shyu",
    "description": "A Fire Sage who aids Aang in connecting with past Avatars in ATLA."
  },
  {
    "name": "Ran and Shaw",
    "description": "Ancient dragons who teach firebending’s true essence in ATLA."
  },
  {
    "name": "Combustion Man",
    "description": "A deadly assassin with unique firebending in ATLA."
  },
  {
    "name": "Yon Rha",
    "description": "Fire Nation soldier who killed Katara’s mother, featured in ATLA and comics."
  },
  {
    "name": "Kiyi",
    "description": "Zuko’s half-sister, introduced in the ATLA comics."
  },
  {
    "name": "Princess Yue",
    "description": "Northern Water Tribe princess who becomes the Moon Spirit in ATLA. Kya (Katara’s mother): Katara and Sokka’s mother, killed by Yon Rha in ATLA."
  },
  {
    "name": "Bato",
    "description": "Hakoda’s friend and a Southern Water Tribe warrior in ATLA."
  },
  {
    "name": "Chief Arnook",
    "description": "Leader of the Northern Water Tribe in ATLA."
  },
  {
    "name": "Kanna",
    "description": "Katara and Sokka’s grandmother, known as Gran-Gran in ATLA."
  },
  {
    "name": "Yagoda",
    "description": "A healer in the Northern Water Tribe in ATLA."
  },
  {
    "name": "Hahn",
    "description": "A Northern Water Tribe warrior and Yue’s betrothed in ATLA."
  },
  {
    "name": "Hama",
    "description": "A waterbender who invented bloodbending in ATLA."
  }
]