[
  {
    "id": "aang",
    "slug": "aang",
    "name": "Aang",
    "description": "Aang is the fun-loving, pacifistic Avatar, the last of the Air Nomads, and the only person capable of bending all four elements. After being frozen for a century, he must master water, earth, and fire to defeat Fire Lord Ozai and end the Hundred Year War.",
    "__type": "character",
    "tags": [],
    "aliases": [],
    "sources": [],
    "image": "[SVG embedded image link]",
    "nation": "Air Nomads",
    "bending": "Airbending (Master), Waterbending, Earthbending, Firebending, Energybending",
    "role": "Avatar, Airbending Master, Co-founder of the United Republic of Nations",
    "overview": "As the Avatar of his time and the last surviving airbender, Aang is tasked with the monumental burden of ending the century-long war waged by the Fire Nation. After being discovered in an iceberg, he embarks on a journey with his friends Katara and Sokka to master the elements. Despite the immense pressure and the loss of his people, Aang remains a kind and goofy kid at heart, ultimately succeeding in his mission by pioneering the use of energybending to defeat Fire Lord Ozai without taking his life.",
    "relationships": [
      "Katara (close friend, love interest, and later wife), Sokka (close friend), Toph (friend and earthbending teacher), Zuko (enemy turned friend and firebending teacher), Appa (lifelong animal companion), Momo (pet lemur), Monk Gyatso (guardian and father figure), Avatar Roku (past life and spiritual guide)"
    ],
    "highlights": [
      "Being freed from an iceberg by Katara and Sokka and embarking on a quest to master the four elements to defeat the Fire Lord",
      "Learning to control the powerful Avatar State and later being taught the ancient art of energybending by a lion turtle",
      "Defeating Fire Lord Ozai by taking away his bending, ending the Hundred Year War, and co-founding the United Republic of Nations with Fire Lord Zuko"
    ],
    "traits": [
      "Fun-loving and Adventurous: He possesses a deep sense of humor and craves the stimulation of new people and places, often taking detours that frustrate his allies"
    ],
    "quotes": [
      "When we hit our lowest point, we are open to the greatest change",
      "The past can be a great teacher"
    ]
  },
  {
    "id": "katara",
    "slug": "katara",
    "name": "Katara",
    "description": "A powerful and compassionate waterbending master from the Southern Water Tribe who discovers the Avatar. She serves as the moral compass for the group and Aang's waterbending teacher, growing into one of the world's most formidable benders and healers.",
    "__type": "character",
    "tags": [],
    "aliases": [],
    "sources": [],
    "image": "[SVG embedded image link]",
    "nation": "Southern Water Tribe",
    "bending": "Waterbending (Master), Healing, Bloodbending",
    "role": "Waterbending Master, Healer, Avatar's Waterbending Teacher",
    "overview": "Katara is a fiercely determined and caring waterbender who, alongside her brother Sokka, finds and frees Aang from an iceberg. She becomes a maternal figure for the group and Aang's first bending teacher, guiding him on his journey. Her mastery of waterbending, including the rare ability to heal, makes her a vital asset in the fight against the Fire Nation and a cornerstone of Team Avatar.",
    "relationships": [
      "Aang (close friend, love interest, and later husband), Sokka (older brother), Hakoda (father), Kya (mother, deceased), Kanna (grandmother), Pakku (master and step-grandfather), Zuko (enemy turned close friend), Toph (close friend)"
    ],
    "highlights": [
      "Discovering Aang in an iceberg and leaving her home in the South Pole to help him save the world",
      "Training under Master Pakku to become a waterbending master and later discovering her powerful healing abilities",
      "Confronting the man who killed her mother and, in the final battle, defeating the unstable Princess Azula"
    ],
    "traits": [
      ""
    ],
    "quotes": [
      "I will never, ever, turn my back on people who need me!  But I know you're going to be okay"
    ]
  },
  {
    "id": "sokka",
    "slug": "sokka",
    "name": "Sokka",
    "description": "A warrior from the Southern Water Tribe and Katara's older brother who, despite being a non-bender, serves as Team Avatar's primary strategist. He provides much of the group's comic relief, relying on his wit, sarcasm, and trusty boomerang.",
    "__type": "character",
    "tags": [],
    "aliases": [],
    "sources": [],
    "image": "[SVG embedded image link]",
    "nation": "Southern Water Tribe",
    "bending": "Non-Bender",
    "role": "Warrior, Tactician, Chieftain (formerly), Chairman of the United Republic Council (formerly)",
    "overview": "Sokka is the pragmatic and inventive non-bender of the group, driven to prove himself a great warrior like his father. Initially skeptical and sarcastic, he grows into a master swordsman and a brilliant leader, masterminding crucial strategies like the invasion of the Fire Nation. His humor, creativity, and unwavering loyalty are essential to Team Avatar's journey and eventual victory.",
    "relationships": [
      "Katara (younger sister), Aang (close friend), Toph (close friend), Zuko (friend and ally), Suki (girlfriend), Yue (first girlfriend, deceased), Hakoda (father), Kya (mother, deceased), Kanna (grandmother)"
    ],
    "highlights": [
      "Leaving his home with Katara and Aang, becoming the team's strategist, navigator, and \"idea guy",
      "\"  Training under the swordmaster Piandao, overcoming his insecurities as a non-bender and forging his own unique \"space sword",
      "\"  Leading the invasion on the Day of Black Sun and later commanding the mission to destroy the Fire Nation's airship fleet during Sozin's Comet"
    ],
    "traits": [
      ""
    ],
    "quotes": [
      "That's all I got",
      "It's pretty much my whole identity",
      "Sokka, the meat and sarcasm guy",
      "My first girlfriend turned into the moon"
    ]
  },
  {
    "id": "zuko",
    "slug": "zuko",
    "name": "Zuko",
    "description": "The exiled Crown Prince of the Fire Nation, recognizable by a prominent burn scar over his left eye given to him by his own father. He initially hunts the Avatar to regain his honor but undergoes a profound transformation, ultimately joining Team Avatar to restore peace.",
    "__type": "character",
    "tags": [],
    "aliases": [],
    "sources": [],
    "image": "[SVG embedded image link]",
    "nation": "Fire Nation",
    "bending": "Firebending (Master), Swordsmanship (Master)",
    "role": "Fire Lord, Firebending Master, Ambassador, Crown Prince (formerly)",
    "overview": "Zuko is the banished prince of the Fire Nation, initially obsessed with capturing the Avatar to restore his honor and his abusive father's love. Guided by his wise uncle, Iroh, Zuko's journey is a story of internal turmoil, struggle, and eventual redemption. He ultimately rejects his father's tyranny, joins Aang to become his firebending teacher, and takes his rightful place as the new Fire Lord to help build an era of peace.",
    "relationships": [
      "Iroh (uncle, mentor, and father figure), Ozai (abusive father and enemy), Azula (younger sister and rival), Ursa (mother), Aang (enemy turned friend and student), Katara (enemy turned friend and healer), Mai (girlfriend)"
    ],
    "highlights": [
      "Being banished by his father and spending years hunting the Avatar, a quest that defined his early motivations and internal conflict",
      "Betraying his Uncle Iroh in Ba Sing Se to regain his place in the Fire Nation, only to later realize his error and confront his father to join Team Avatar",
      "Defeating his sister Azula in a final Agni Kai and being crowned Fire Lord, vowing to end the war and restore his and his nation's honor"
    ],
    "traits": [
      ""
    ],
    "quotes": [
      "I used to think this scar marked me – the mark of the banished prince, cursed to chase the Avatar forever",
      "But lately, I've realized I'm free to determine my own destiny, even if I'll never be free of my mark",
      "Hello, Zuko here"
    ]
  },
  {
    "id": "toph-beifong",
    "slug": "toph-beifong",
    "name": "Toph Beifong",
    "description": "A blind but immensely powerful earthbending master from a wealthy Gaoling family who becomes Aang's teacher. She uses earthbending as an extension of her senses to \"see\" via vibrations in the ground and is the inventor of metalbending.",
    "__type": "character",
    "tags": [],
    "aliases": [],
    "sources": [],
    "image": "[SVG embedded image link]",
    "nation": "Earth Kingdom",
    "bending": "Earthbending (Master), Metalbending (Inventor), Sandbending",
    "role": "Earthbending Master, Aang's Earthbending Teacher, Chief of Police (retired), Founder of the Metalbending Police Force",
    "overview": "Toph Beifong is an earthbending prodigy who, despite being blind since birth, became one of the most powerful benders in the world by learning from badgermoles. Rebelling against her sheltered upbringing, she runs away to join Team Avatar as Aang's tough, uncompromising earthbending teacher. Her unique mastery of the art, including her groundbreaking invention of metalbending, makes her an invaluable and legendary member of the team.",
    "relationships": [
      "Aang (student and friend), Katara (friend and occasional rival), Sokka (friend and crush), Lao and Poppy Beifong (estranged parents), Lin and Suyin (daughters)"
    ],
    "highlights": [
      "Running away from her overprotective parents to travel with Avatar Aang and become his earthbending teacher",
      "Inventing the art of metalbending while imprisoned in a metal cage, a skill previously thought impossible for earthbenders",
      "Becoming the first Chief of Police in the newly formed Republic City, where she established the elite Metalbending Police Force"
    ],
    "traits": [
      ""
    ],
    "quotes": [
      "I am the greatest earthbender in the world! Don't you two dunderheads ever forget it!  There's no different angle, no clever solution, no trickity-trick that's gonna move that rock",
      "You've gotta face it head on"
    ]
  },
  {
    "id": "azula",
    "slug": "azula",
    "name": "Azula",
    "description": "The manipulative and power-hungry princess of the Fire Nation and a firebending prodigy known for her intense blue flames and lightning generation. She is a primary antagonist to Team Avatar, whose obsession with perfection and control ultimately leads to her own mental downfall.",
    "__type": "character",
    "tags": [],
    "aliases": [],
    "sources": [],
    "image": "[SVG embedded image link]",
    "nation": "Fire Nation",
    "bending": "Firebending (Master), Lightning Generation",
    "role": "Princess of the Fire Nation, Crown Princess (formerly), Head of the Dai Li (formerly)",
    "overview": "Azula is Zuko's younger sister, a firebending prodigy, and her father's favored child. A cunning and ruthless strategist, she orchestrates the fall of Ba Sing Se and serves as a key adversary to Team Avatar. Her relentless pursuit of power and perfection, rooted in a belief that her mother saw her as a monster, masks a deep mental instability that surfaces after being betrayed by her closest friends and defeated by her brother.",
    "relationships": [
      "Ozai (father and role model), Ursa (mother, source of resentment), Zuko (older brother and rival), Mai and Ty Lee (childhood friends whom she controlled and who later betrayed her), Iroh (uncle and enemy)"
    ],
    "highlights": [
      "Leading a successful coup of the Earth Kingdom capital, Ba Sing Se, by manipulating the Dai Li and nearly killing the Avatar",
      "Being betrayed by her closest friends, Mai and Ty Lee, which triggers her descent into paranoia and madness",
      "Defeated by Zuko and Katara in a final Agni Kai during Sozin's Comet, which results in a complete mental breakdown"
    ],
    "traits": [
      ""
    ],
    "quotes": [
      "Trust is for fools! Fear is the only reliable way",
      "Even you fear me",
      "Almost isn't good enough!"
    ]
  },
  {
    "id": "fire-flakes",
    "slug": "fire-flakes",
    "name": "Fire Flakes",
    "description": "Crispy, spicy chips from the Fire Nation.",
    "__type": "food",
    "tags": [],
    "aliases": [],
    "sources": [],
    "image": null,
    "region": "fire nation"
  },
  {
    "id": "sea-prunes",
    "slug": "sea-prunes",
    "name": "Sea Prunes",
    "description": "A Water Tribe delicacy, notoriously acquired taste.",
    "__type": "food",
    "tags": [],
    "aliases": [],
    "sources": [],
    "image": null,
    "region": "water tribe"
  },
  {
    "id": "komodo-sausage",
    "slug": "komodo-sausage",
    "name": "Komodo Sausage",
    "description": "Spicy sausage made from komodo chicken.",
    "__type": "food",
    "tags": [],
    "aliases": [],
    "sources": [],
    "image": null,
    "region": "fire nation"
  },
  {
    "id": "mango-jerky",
    "slug": "mango-jerky",
    "name": "Mango Jerky",
    "description": "Dried, chewy mango snack popular with Air Nomads.",
    "__type": "food",
    "tags": [],
    "aliases": [],
    "sources": [],
    "image": null,
    "region": "air nomad"
  },
  {
    "id": "moon-peaches",
    "slug": "moon-peaches",
    "name": "Moon Peaches",
    "description": "Sweet, juicy peaches from the Earth Kingdom.",
    "__type": "food",
    "tags": [],
    "aliases": [],
    "sources": [],
    "image": null,
    "region": "earth kingdom"
  },
  {
    "id": "cactus-juice",
    "slug": "cactus-juice",
    "name": "Cactus Juice",
    "description": "Strange, potent drink found in the Si Wong Desert.",
    "__type": "food",
    "tags": [],
    "aliases": [],
    "sources": [],
    "image": null,
    "region": "earth kingdom"
  },
  {
    "id": "momos-fruit-pie",
    "slug": "momos-fruit-pie",
    "name": "Momo's Fruit Pie",
    "description": "Pastry stuffed with assorted fruits, favorite of Momo.",
    "__type": "food",
    "tags": [],
    "aliases": [],
    "sources": [],
    "image": null,
    "region": "air nomad"
  },
  {
    "id": "unagi-sushi",
    "slug": "unagi-sushi",
    "name": "Unagi Sushi",
    "description": "Freshwater eel dish, local specialty of Kyoshi Island.",
    "__type": "food",
    "tags": [],
    "aliases": [],
    "sources": [],
    "image": null,
    "region": "earth kingdom"
  },
  {
    "id": "steamed-seaweed-noodles",
    "slug": "steamed-seaweed-noodles",
    "name": "Steamed Seaweed Noodles",
    "description": "Healthy and light, often served by the Foggy Swamp Tribe.",
    "__type": "food",
    "tags": [],
    "aliases": [],
    "sources": [],
    "image": null,
    "region": "water tribe"
  },
  {
    "id": "plum-bao",
    "slug": "plum-bao",
    "name": "Plum Bao",
    "description": "Steamed buns filled with tart plum jam.",
    "__type": "food",
    "tags": [],
    "aliases": [],
    "sources": [],
    "image": null,
    "region": "earth kingdom"
  }
]