[
  {
    "name": "Aang",
    "nation": "Air Nomads",
    "image": "[SVG embedded image link]",
    "description": "As the Avatar of his time and the last surviving airbender, Aang is tasked with the monumental burden of ending the century-long war waged by the Fire Nation. After being discovered in an iceberg, he embarks on a journey with his friends Katara and Sokka to master the elements. Despite the immense pressure and the loss of his people, Aang remains a kind and goofy kid at heart, ultimately succeeding in his mission by pioneering the use of energybending to defeat Fire Lord Ozai without taking his life.",
    "bending": "Airbending (Master), Waterbending, Earthbending, Firebending, Energybending Occupation/Role: Avatar, Airbending Master, Co-founder of the United Republic of Nations",
    "overview": "As the Avatar of his time and the last surviving airbender, Aang is tasked with the monumental burden of ending the century-long war waged by the Fire Nation. After being discovered in an iceberg, he embarks on a journey with his friends Katara and Sokka to master the elements. Despite the immense pressure and the loss of his people, Aang remains a kind and goofy kid at heart, ultimately succeeding in his mission by pioneering the use of energybending to defeat Fire Lord Ozai without taking his life.",
    "relationships": "Katara (close friend, love interest, and later wife), Sokka (close friend), Toph (friend and earthbending teacher), Zuko (enemy turned friend and firebending teacher), Appa (lifelong animal companion), Momo (pet lemur), Monk Gyatso (guardian and father figure), Avatar Roku (past life and spiritual guide).",
    "shortDescription": "Aang is the fun-loving, pacifistic Avatar, the last of the Air Nomads, and the only person capable of bending all four elements. After being frozen for a century, he must master water, earth, and fire to defeat Fire Lord Ozai and end the Hundred Year War.",
    "__type": "character"
  },
  {
    "name": "Katara",
    "nation": "Southern Water Tribe",
    "image": "[SVG embedded image link]",
    "description": "Katara is a fiercely determined and caring waterbender who, alongside her brother Sokka, finds and frees Aang from an iceberg. She becomes a maternal figure for the group and Aang's first bending teacher, guiding him on his journey. Her mastery of waterbending, including the rare ability to heal, makes her a vital asset in the fight against the Fire Nation and a cornerstone of Team Avatar.",
    "bending": "Waterbending (Master), Healing, Bloodbending Occupation/Role: Waterbending Master, Healer, Avatar's Waterbending Teacher",
    "overview": "Katara is a fiercely determined and caring waterbender who, alongside her brother Sokka, finds and frees Aang from an iceberg. She becomes a maternal figure for the group and Aang's first bending teacher, guiding him on his journey. Her mastery of waterbending, including the rare ability to heal, makes her a vital asset in the fight against the Fire Nation and a cornerstone of Team Avatar.",
    "relationships": "Aang (close friend, love interest, and later husband), Sokka (older brother), Hakoda (father), Kya (mother, deceased), Kanna (grandmother), Pakku (master and step-grandfather), Zuko (enemy turned close friend), Toph (close friend).",
    "shortDescription": "A powerful and compassionate waterbending master from the Southern Water Tribe who discovers the Avatar. She serves as the moral compass for the group and Aang's waterbending teacher, growing into one of the world's most formidable benders and healers.",
    "__type": "character"
  },
  {
    "name": "Sokka",
    "nation": "Southern Water Tribe",
    "image": "[SVG embedded image link]",
    "description": "Sokka is the pragmatic and inventive non-bender of the group, driven to prove himself a great warrior like his father. Initially skeptical and sarcastic, he grows into a master swordsman and a brilliant leader, masterminding crucial strategies like the invasion of the Fire Nation. His humor, creativity, and unwavering loyalty are essential to Team Avatar's journey and eventual victory.",
    "bending": "Non-Bender Occupation/Role: Warrior, Tactician, Chieftain (formerly), Chairman of the United Republic Council (formerly)",
    "overview": "Sokka is the pragmatic and inventive non-bender of the group, driven to prove himself a great warrior like his father. Initially skeptical and sarcastic, he grows into a master swordsman and a brilliant leader, masterminding crucial strategies like the invasion of the Fire Nation. His humor, creativity, and unwavering loyalty are essential to Team Avatar's journey and eventual victory.",
    "relationships": "Katara (younger sister), Aang (close friend), Toph (close friend), Zuko (friend and ally), Suki (girlfriend), Yue (first girlfriend, deceased), Hakoda (father), Kya (mother, deceased), Kanna (grandmother).",
    "shortDescription": "A warrior from the Southern Water Tribe and Katara's older brother who, despite being a non-bender, serves as Team Avatar's primary strategist. He provides much of the group's comic relief, relying on his wit, sarcasm, and trusty boomerang.",
    "__type": "character"
  },
  {
    "name": "Zuko",
    "nation": "Fire Nation",
    "image": "[SVG embedded image link]",
    "description": "Zuko is the banished prince of the Fire Nation, initially obsessed with capturing the Avatar to restore his honor and his abusive father's love. Guided by his wise uncle, Iroh, Zuko's journey is a story of internal turmoil, struggle, and eventual redemption. He ultimately rejects his father's tyranny, joins Aang to become his firebending teacher, and takes his rightful place as the new Fire Lord to help build an era of peace.",
    "bending": "Firebending (Master), Swordsmanship (Master) Occupation/Role: Fire Lord, Firebending Master, Ambassador, Crown Prince (formerly)",
    "overview": "Zuko is the banished prince of the Fire Nation, initially obsessed with capturing the Avatar to restore his honor and his abusive father's love. Guided by his wise uncle, Iroh, Zuko's journey is a story of internal turmoil, struggle, and eventual redemption. He ultimately rejects his father's tyranny, joins Aang to become his firebending teacher, and takes his rightful place as the new Fire Lord to help build an era of peace.",
    "relationships": "Iroh (uncle, mentor, and father figure), Ozai (abusive father and enemy), Azula (younger sister and rival), Ursa (mother), Aang (enemy turned friend and student), Katara (enemy turned friend and healer), Mai (girlfriend).",
    "shortDescription": "The exiled Crown Prince of the Fire Nation, recognizable by a prominent burn scar over his left eye given to him by his own father. He initially hunts the Avatar to regain his honor but undergoes a profound transformation, ultimately joining Team Avatar to restore peace.",
    "__type": "character"
  },
  {
    "name": "Toph Beifong",
    "nation": "Earth Kingdom",
    "image": "[SVG embedded image link]",
    "description": "Toph Beifong is an earthbending prodigy who, despite being blind since birth, became one of the most powerful benders in the world by learning from badgermoles. Rebelling against her sheltered upbringing, she runs away to join Team Avatar as Aang's tough, uncompromising earthbending teacher. Her unique mastery of the art, including her groundbreaking invention of metalbending, makes her an invaluable and legendary member of the team.",
    "bending": "Earthbending (Master), Metalbending (Inventor), Sandbending Occupation/Role: Earthbending Master, Aang's Earthbending Teacher, Chief of Police (retired), Founder of the Metalbending Police Force",
    "overview": "Toph Beifong is an earthbending prodigy who, despite being blind since birth, became one of the most powerful benders in the world by learning from badgermoles. Rebelling against her sheltered upbringing, she runs away to join Team Avatar as Aang's tough, uncompromising earthbending teacher. Her unique mastery of the art, including her groundbreaking invention of metalbending, makes her an invaluable and legendary member of the team.",
    "relationships": "Aang (student and friend), Katara (friend and occasional rival), Sokka (friend and crush), Lao and Poppy Beifong (estranged parents), Lin and Suyin (daughters).",
    "shortDescription": "A blind but immensely powerful earthbending master from a wealthy Gaoling family who becomes Aang's teacher. She uses earthbending as an extension of her senses to \"see\" via vibrations in the ground and is the inventor of metalbending.",
    "__type": "character"
  },
  {
    "name": "Azula",
    "nation": "Fire Nation",
    "image": "[SVG embedded image link]",
    "description": "Azula is Zuko's younger sister, a firebending prodigy, and her father's favored child. A cunning and ruthless strategist, she orchestrates the fall of Ba Sing Se and serves as a key adversary to Team Avatar. Her relentless pursuit of power and perfection, rooted in a belief that her mother saw her as a monster, masks a deep mental instability that surfaces after being betrayed by her closest friends and defeated by her brother.",
    "bending": "Firebending (Master), Lightning Generation Occupation/Role: Princess of the Fire Nation, Crown Princess (formerly), Head of the Dai Li (formerly)",
    "overview": "Azula is Zuko's younger sister, a firebending prodigy, and her father's favored child. A cunning and ruthless strategist, she orchestrates the fall of Ba Sing Se and serves as a key adversary to Team Avatar. Her relentless pursuit of power and perfection, rooted in a belief that her mother saw her as a monster, masks a deep mental instability that surfaces after being betrayed by her closest friends and defeated by her brother.",
    "relationships": "Ozai (father and role model), Ursa (mother, source of resentment), Zuko (older brother and rival), Mai and Ty Lee (childhood friends whom she controlled and who later betrayed her), Iroh (uncle and enemy).",
    "shortDescription": "The manipulative and power-hungry princess of the Fire Nation and a firebending prodigy known for her intense blue flames and lightning generation. She is a primary antagonist to Team Avatar, whose obsession with perfection and control ultimately leads to her own mental downfall.",
    "__type": "character"
  }
]